{"status":"ok","totalResults":10848,"articles":[{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Justices ask government for input on Texas electric grid dispute - Reuters","description":"Justices ask government for input on Texas electric grid dispute  Reuters","url":"https://consent.google.com/ml?continue=https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LnJldXRlcnMuY29tL2xlZ2FsL2p1c3RpY2VzLWFzay1nb3Zlcm5tZW50LWlucHV0LXRleGFzLWVsZWN0cmljLWdyaWQtZGlzcHV0ZS0yMDIzLTAzLTA2L9IBAA?oc%3D5&gl=FR&hl=en-US&pc=n&src=1","urlToImage":null,"publishedAt":"2023-03-06T20:00:00Z","content":"We use cookies and data to<ul><li>Deliver and maintain Google services</li><li>Track outages and protect against spam, fraud, and abuse</li><li>Measure audience engagement and site statistics to unde… [+1131 chars]"},{"source":{"id":null,"name":"MacRumors"},"author":"Hartley Charlton","title":"Gurman: Apple Headset Could Feature 'In-Air' Typing for Text Input, No iPhone Pairing Required","description":"Apple's first mixed-reality headset may feature \"in-air\" typing capabilities and used independently without an accompanying iPhone, according to Bloomberg's Mark Gurman.\n\n\n\nApple headset concept by David Lewis and Marcus Kane\n\n\n\nIn this latest \"Power On\" news…","url":"https://www.macrumors.com/2023/02/26/gurman-apple-headset-in-air-typing-for-text-input/","urlToImage":"https://images.macrumors.com/t/4lBUzjtFFejGLqIlSoA83H0LUw4=/1600x/article-new/2023/02/apple-mixed-reality-headset-concept-by-david-lewis-and-marcus-kane.jpg","publishedAt":"2023-02-26T15:35:19Z","content":"Apple's first mixed-reality headset may feature \"in-air\" typing capabilities and can be used independently without an accompanying iPhone, according to Bloomberg's Mark Gurman.\r\nIn the latest edition… [+1805 chars]"},{"source":{"id":null,"name":"Lifehacker.com"},"author":"Daniel Oropeza","title":"Get a Month of Xbox Game Pass Ultimate for $2.79 Right Now","description":"Xbox Game Pass Ultimate just got a bit cheaper—at least for a month. For a limited time, you can get a month of Xbox’s online games and Xbox Live for 84% off: CD Keys is selling digital codes 84% off from their usual $15 price.Read more...","url":"https://lifehacker.com/get-a-month-of-xbox-game-pass-ultimate-for-2-79-right-1850150753","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/e2fd7ce4a1a3d50cf810532743f5a5f4.jpg","publishedAt":"2023-02-23T19:00:00Z","content":"Xbox Game Pass Ultimate just got a bit cheaperat least for a month. For a limited time, you can get a month of Xboxs online games and Xbox Live for 84% off: CD Keys is selling digital codes 84% off f… [+2204 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Mariella Moon","title":"Sony's PS5 update with Discord voice chat begins rolling out to all","description":"The PlayStation 5 update that comes with support for Discord voice chats on the console has now made its way out of beta and to all PS5 gamers. Those who've already installed System Update 7.0 can now activate Discord calls on their console, so long as they d…","url":"https://www.engadget.com/sony-ps5-update-discord-voice-chat-rollout-131503910.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/nTBc.WVn49e8wQBGCLY_gQ--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2022-11/6dc501e0-6b40-11ed-bf7f-6c2be5e1911f.cf.jpg","publishedAt":"2023-03-08T13:15:03Z","content":"The PlayStation 5 update that comes with support for Discord voice chats on the console has now made its way out of beta and to all PS5 gamers. Those who've already installed System Update 7.0 can no… [+2224 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Chris Stokel-Walker","title":"ChatGPT's API Is Here. Let the AI Gold Rush Begin","description":"Businesses can now get paid for services built on the large language model, meaning chatbots are going to start appearing everywhere.","url":"https://www.wired.com/story/chatgpt-api-ai-gold-rush/","urlToImage":"https://media.wired.com/photos/6402a02a95705afb854fd892/191:100/w_1280,c_limit/business_chatgpt_api_open.jpg","publishedAt":"2023-03-06T12:00:00Z","content":"When OpenAI, the San Francisco company developing artificial intelligence tools, announced the release of ChatGPT in November 2022, former Facebook and Oculus employee Daniel Habib moved quickly.\r\nWi… [+3727 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Will Shanklin","title":"OpenAI will let developers build ChatGPT into their apps","description":"OpenAI, the company behind ChatGPT and DALL-E 2, announced several significant changes today. First, it’s launching developer APIs for ChatGPT and the Whisper speech-transcription model. It also changed its terms of service to let developers opt out of using …","url":"https://www.engadget.com/openai-will-let-developers-build-chatgpt-into-their-apps-204737530.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/sL_n06mvOrtpzNG1Gw8vpA--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-02/d721f180-b86f-11ed-bf3f-20ec05b52824.cf.jpg","publishedAt":"2023-03-01T20:47:37Z","content":"OpenAI, the company behind ChatGPT and DALL-E 2, announced several significant changes today. First, its launching developer APIs for ChatGPT and the Whisper speech-transcription model. It also chang… [+2655 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Vittoria Elliott","title":"Uber and Lyft Are More Likely to Fire Drivers of Color","description":"After passenger complaints, non-white drivers are suspended or deactivated more often than their white counterparts, according to new research.","url":"https://www.wired.com/story/uber-and-lyft-are-more-likely-to-fire-drivers-of-color/","urlToImage":"https://media.wired.com/photos/63fd620b58853a794e686a05/191:100/w_1280,c_limit/Rideshare-Algorithms-More-Likely-To-Fire-POC-Drivers-Business-1142303809.jpg","publishedAt":"2023-02-28T17:36:14Z","content":"James Jordan had worked as an Uber driver in Los Angeles for five and a half years by the spring of 2022. But in late March, after a flurry of customer complaints, Jordan found that his account had b… [+3268 chars]"},{"source":{"id":null,"name":"Smashingmagazine.com"},"author":"hello@smashingmagazine.com (Olufunke Moronfolu)","title":"Building Complex Forms In Vue","description":"Did you know that creating a complex form can be progressively enhanced using some Vue features like the v-for and the v-model? In this article, Olufunke shares some basic Vue core features that are super useful when building out the complex form in your day-…","url":"https://www.smashingmagazine.com/2023/03/building-complex-forms-vue/","urlToImage":"https://files.smashing.media/articles/building-complex-forms-vue/meta-building-complex-forms-vue.jpg","publishedAt":"2023-03-09T10:00:00Z","content":"More often than not, web engineers always have causes to build out forms, from simple to complex. It is also a familiar pain in the shoe for engineers how fast codebases get incredibly messy and inco… [+18720 chars]"},{"source":{"id":null,"name":"Smashingmagazine.com"},"author":"hello@smashingmagazine.com (Sandrina Pereira)","title":"A Guide To Accessible Form Validation","description":"Each time we build a field validation from scratch, accessibility doesn’t come out of the box. In this guide, Sandrina breaks down what we need to take into consideration, so that nobody gets stuck on an inaccessible invalid field.","url":"https://www.smashingmagazine.com/2023/02/guide-accessible-form-validation/","urlToImage":"https://files.smashing.media/articles/guide-accessible-form-validation/guide-accessible-form-validation.jpg","publishedAt":"2023-02-27T14:00:00Z","content":"When it comes to form validation, we can explore it from two perspectives: usability and accessibility. Whats the difference between usability and accessibility? you may ask. Lets start from there.\r\n… [+27379 chars]"},{"source":{"id":null,"name":"MacRumors"},"author":"Tim Hardwick","title":"Apple Exploring Viability of Foldable Devices With Touch-Sensitive Chassis","description":"Apple has been awarded yet another patent for a foldable device, with the latest embodiment featuring a clamshell chassis with touch-sensitive areas that serve as virtual buttons (via CNBC).\n\n\n\n\n\nFiled by Apple in April 2021 and approved this week by the U.S.…","url":"https://www.macrumors.com/2023/02/16/apple-patent-foldable-iphone-touch-chassis/","urlToImage":"https://images.macrumors.com/t/4iZovm9LuV-8TZ4cikB3kl9cE8g=/1600x/article-new/2020/10/Foldable-iPhone-2023-Feature-Blue.jpg","publishedAt":"2023-02-16T13:52:45Z","content":"Apple has been awarded yet another patent for a foldable device, with the latest embodiment featuring a clamshell design with touch-sensitive areas on the sides that serve as virtual buttons (via CNB… [+1791 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Steve Contorno","title":"Florida bill would give DeSantis more power over state universities and ban gender studies","description":"A new bill overhauling Florida universities to match Gov. Ron DeSantis' vision for higher education would shift power at state schools into the hands of the Republican leader's political appointees and ban gender studies as a field of study.","url":"https://www.cnn.com/2023/02/24/politics/ron-desantis-florida-universities-gender-studies/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/230224125734-02-florida-bill-gender-studies-ban-state-universities.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2023-02-24T18:39:45Z","content":"A new bill overhauling Florida universities to match Gov. Ron DeSantis vision for higher education would shift power at state schools into the hands of the Republican leaders political appointees and… [+2460 chars]"},{"source":{"id":null,"name":"Slashdot.org"},"author":"EditorDavid","title":"What's New in Firefox Version 110.0?","description":"Valentine's Day saw Mozilla releasing version 110.0 of its Firefox browser. OMG Ubuntu highlights some of its new features:\n\nFirefox already supports importing bookmarks, history, and passwords from Microsoft Edge, Google Chrome, Chromium, and Safari but once…","url":"https://news.slashdot.org/story/23/02/18/0523209/whats-new-in-firefox-version-1100","urlToImage":"https://a.fsdn.com/sd/topics/firefox_64.png","publishedAt":"2023-02-18T16:34:00Z","content":"Firefox already supports importing bookmarks, history, and passwords from Microsoft Edge, Google Chrome, Chromium, and Safari but once you have the Firefox 110 update you can also import data from Op… [+462 chars]"},{"source":{"id":null,"name":"Android Central"},"author":"andrew.myrick@futurenet.com (Andrew Myrick)","title":"How to use Bixby Text Call on Samsung Galaxy phones","description":"If you're tired of answering the neverending onslaught of spam calls, or just don't have the voice to talk on the phone, let Bixby Text Call do the heavy-lifting for you.","url":"https://www.androidcentral.com/phones/how-to-use-bixby-text-call","urlToImage":"https://cdn.mos.cms.futurecdn.net/kz8hjYWE9LpT4tzF8QLtiP-1200-80.jpg","publishedAt":"2023-03-11T13:45:41Z","content":"For years, owners of Google's Pixel phones have had access to an absolutely wonderful feature known as Call Screening. With this, you can let Google Assistant answer the phone, determining whether it… [+2301 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Robin Kearey","title":"The CryptMaster 2001 Provides Basic Lessons in Cryptography","description":"Sending secret messages to your friends is fun, but today it’s so simple that you don’t even notice it anymore: practically any serious messaging system features encryption of some sort. …read more","url":"https://hackaday.com/2023/02/13/the-cryptmaster-2001-provides-basic-lessons-in-cryptography/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/02/CryptMaster-2001.jpg","publishedAt":"2023-02-13T16:30:39Z","content":"Sending secret messages to your friends is fun, but today it’s so simple that you don’t even notice it anymore: practically any serious messaging system features encryption of some sort. To teach his… [+1349 chars]"},{"source":{"id":null,"name":"9to5Mac"},"author":"Michael Potuck","title":"Microsoft launches updated Bing, Edge, and Skype iOS apps with ChatGPT and voice input","description":"After kicking off the launch of its new Bing experience on desktop last week to early adopters, Microsoft has released the new Bing and Edge iOS apps with its AI ChatGPT integration in preview. Along with that, the AI-powered Bing is available in the latest i…","url":"https://9to5mac.com/2023/02/22/microsoft-launches-bing-ios-app-with-chatgpt/","urlToImage":"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2023/02/bing-ios-app-chatgpt-launch.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1","publishedAt":"2023-02-22T15:00:55Z","content":"After kicking off the launch of its new Bing experience on desktop last week to early adopters, Microsoft has released the new Bing and Edge iOS apps with its AI ChatGPT integration in preview. Along… [+3123 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Nikki Main","title":"TikTok Complains It's 'Under a Cloud' Following Its Most Recent Ban","description":"TikTok is pushing back against the European Union for not informing the company that they were banning the app on all government devices. The EU also took steps to ban the Chinese-owned app on staff’s personal devices with corporate access, amid concerns that…","url":"https://gizmodo.com/tiktok-tiktok-ban-eu-social-media-bytedance-china-1850154826","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/9b0529b121805bd021457aca030ab8e9.jpg","publishedAt":"2023-02-24T16:25:00Z","content":"TikTok is pushing back against the European Union for not informing the company that they were banning the app on all government devices. The EU also took steps to ban the Chinese-owned app on staffs… [+2991 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"BMO to buy Air Miles after loyalty program loses key retailers, files for creditor protection amid heavy debts - The Globe and Mail","description":"<ol><li>BMO to buy Air Miles after loyalty program loses key retailers, files for creditor protection amid heavy debts  The Globe and Mail\r\n</li><li>BMO looks for consumer input to update the Air Miles reward program  BNN Bloomberg\r\n</li><li>Air Miles program…","url":"https://consent.google.com/ml?continue=https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LnRoZWdsb2JlYW5kbWFpbC5jb20vYnVzaW5lc3MvYXJ0aWNsZS1ibW8tYWNxdWlyZXMtYWlyLW1pbGVzLXByb2dyYW0v0gEA?oc%3D5&gl=FR&hl=en-US&cm=2&pc=n&src=1","urlToImage":null,"publishedAt":"2023-03-10T23:40:36Z","content":"We use cookies and data to<ul><li>Deliver and maintain Google services</li><li>Track outages and protect against spam, fraud, and abuse</li><li>Measure audience engagement and site statistics to unde… [+1131 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Dave Rowntree","title":"Like Chording But Not","description":"Repetitive strain injuries (RSI) can be a real pain. You’ve got a shiny new laptop, and everything’s going smoothly, but suddenly you can’t use it without agonizing (as in typing-speed …read more","url":"https://hackaday.com/2023/02/17/like-chording-but-not/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/02/resting-fingers.jpg","publishedAt":"2023-02-17T19:30:30Z","content":"Repetitive strain injuries (RSI) can be a real pain. You’ve got a shiny new laptop, and everything’s going smoothly, but suddenly you can’t use it without agonizing (as in typing-speed reducing) pain… [+1773 chars]"},{"source":{"id":null,"name":"Lifehacker.com"},"author":"Anna Lee Beyer","title":"The Easiest Way to Be a Better Parent to Your Teenager","description":"Do you know what your teenager is thinking, feeling, or doing most of the time? Maybe you sense a sullen attitude one day, but you have no idea if it’s a problem at school, a social schism, or just the demeanor of the day. If you feel like your teen is a blac…","url":"https://lifehacker.com/the-easiest-way-to-be-a-better-parent-to-your-teenager-1850100478","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/78c19fc66d63ec1ee85997540678d888.jpg","publishedAt":"2023-02-13T14:00:00Z","content":"Do you know what your teenager is thinking, feeling, or doing most of the time? Maybe you sense a sullen attitude one day, but you have no idea if its a problem at school, a social schism, or just th… [+6652 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Tom Nardi","title":"This Open Hardware Li-Ion Charger Skips the TP4056","description":"There’s a good chance that if you build something which includes the ability to top up a lithium-ion battery, it’s going to involve the incredibly common TP4056 charger IC. Now, …read more","url":"https://hackaday.com/2023/03/11/this-open-hardware-li-ion-charger-skips-the-tp4056/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/03/bq2_feat.jpg","publishedAt":"2023-03-12T06:00:31Z","content":"There’s a good chance that if you build something which includes the ability to top up a lithium-ion battery, it’s going to involve the incredibly common TP4056 charger IC. Now, there’s certainly not… [+1648 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Andrew Tarantola","title":"The Ghostwriter typewriter brings generative AI to the printed page","description":"Running from 1992 through 1995, Ghostwriter, the beloved PBS children’s television show, followed a diverse group of friends as they solved mysteries around their Brooklyn neighborhood with the help of their haunted typewriter, a cursed item possessed by the …","url":"https://www.engadget.com/the-ghostwriter-typewriter-brings-generative-ai-to-the-printed-page-170016720.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/Xwnhp58EJouIm27Zxde6bA--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-02/87e37de0-ae16-11ed-bf3f-4920fca01694.cf.jpg","publishedAt":"2023-02-16T17:00:16Z","content":"Running from 1992 through 1995, Ghostwriter, the beloved PBS childrens television show, followed a diverse group of friends as they solved mysteries around their Brooklyn neighborhood with the help o… [+6185 chars]"},{"source":{"id":null,"name":"MacRumors"},"author":"Juli Clover","title":"Apple's Work on Touchscreen Macs: What We Know So Far","description":"Some Apple fans have long wanted Apple to combine the functionality of the iPad with the Mac, and it appears that it's finally going to happen. Apple is rumored to be working on touchscreen Mac technology, and we could see the first touchscreen Mac in just a …","url":"https://www.macrumors.com/guide/touchscreen-mac/","urlToImage":"https://images.macrumors.com/t/ENUxq3xBCYWdt2w4W6_Q6h3z-wQ=/2500x/article-new/2023/01/Apple-MacBook-Pro-M2-Feature-Blue-Green.jpg","publishedAt":"2023-03-10T23:33:40Z","content":"Some Apple fans have long wanted Apple to combine the functionality of the iPad with the Mac, and it appears that it's finally going to happen. Apple is rumored to be working on touchscreen Mac techn… [+2708 chars]"},{"source":{"id":null,"name":"Vgel.me"},"author":"Theia Vogel","title":"GPT-3 will ignore tools when it disagrees with them","description":"Augmenting GPT-3 with tools is a popular technique right now. But is GPT-3 really using them?","url":"https://vgel.me/posts/tools-not-needed/","urlToImage":null,"publishedAt":"2023-03-06T21:21:17Z","content":"I recently stumbled on a Twitter thread by John Wiseman where GPT-3 quite impressively wrote and debugged a fibonacci function in a Python REPL.\r\nIt was asked to calculate the 10th fibonacci number, … [+14964 chars]"},{"source":{"id":null,"name":"Github.io"},"author":null,"title":"pix2pix-zero: Zero-Shot Image-to-Image Translation","description":"Zero-shot Image-to-Image Translation","url":"https://pix2pixzero.github.io/","urlToImage":"resources/teaser.jpeg","publishedAt":"2023-02-13T23:08:13Z","content":"Zero-shot Image-to-Image Translation\r\nWe propose pix2pix-zero, a diffusion-based image-to-image approach that allows users to \r\n specify the edit direction on-the-fly (e.g., cat to dog). Our method c… [+2582 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"bnguyen@insider.com (Britney Nguyen)","title":"ChatGPT isn't the only cool AI tool made by OpenAI — check out DALL-E, Whisper, and Codex","description":"OpenAI has other AI tools like DALL-E 2, which quickly creates imaginative artwork, and Whisper, which transcribes and translates speech into text.","url":"https://www.businessinsider.com/whisper-openai-dalle-2-ai-art-codex-who-owns-chatgpt-2023-3","urlToImage":"https://i.insider.com/640244cb37125e0018a10674?width=1200&format=jpeg","publishedAt":"2023-03-04T10:35:00Z","content":"ChatGPT quickly went viral after it was released in November. But the startup behind it, OpenAI, has other AI products too.\r\nJust months earlier, OpenAI removed the waitlist for its generative AI art… [+3025 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Arya Voronova","title":"ATtiny85 Automates Your Smartphone","description":"It might not seem too impressive these days, but when microcontrollers with hardware USB support were more expensive and rare, the VUSB library was often used to create USB devices with an ATtiny85…","url":"https://hackaday.com/2023/03/02/attiny85-automates-your-smartphone/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/02/hadimg_digicombo_feat.png","publishedAt":"2023-03-02T19:30:04Z","content":"It might not seem too impressive these days, but when microcontrollers with hardware USB support were more expensive and rare, the VUSB library was often used to create USB devices with an ATtiny85. … [+1794 chars]"},{"source":{"id":null,"name":"CNET"},"author":"Max McHone","title":"Get Ready for Emergencies With This Discounted Anker Portable Power Station - CNET","description":"The Anker 521 can charge up to six devices at once, and right now you can snag one on sale for $187.","url":"https://www.cnet.com/deals/be-prepared-for-whatever-life-throws-at-you-with-60-off-this-anker-portable-power-station/","urlToImage":"https://www.cnet.com/a/img/resize/729ed89eb0c82635c5346c3739cee92e5016fedf/hub/2023/02/28/6c3cfc71-98b9-4798-98ca-502c0e567671/anker-521-power-station.jpg?auto=webp&fit=crop&height=630&width=1200","publishedAt":"2023-02-28T13:41:32Z","content":"Between sever thunderstorms, hurricanes, wildfires, blizzards, and other unpredictable natural disasters you never know when you could be facing a power outage. And like the old saying goes, it's alw… [+1459 chars]"},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Beth Mole","title":"Hospital’s water purification system stripped out chlorine, killing 3 patients","description":"It was supposed to improve taste, but instead led to deadly infections.","url":"https://arstechnica.com/science/2023/03/hospitals-water-purification-system-stripped-out-chlorine-killing-3-patients/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1238163265-760x380.jpeg","publishedAt":"2023-03-07T18:32:04Z","content":"Enlarge/ Part of the Brigham and Women's Hospital in Boston on Dec. 16, 2021.\r\n0 with \r\nWater purification systems installed in two ice machines in a Boston hospital were supposed to make the water t… [+5410 chars]"},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Benj Edwards","title":"US Copyright Office withdraws copyright for AI-generated comic artwork","description":"Zarya images \"not protected by copyright.\" Words and arrangement remain protected.","url":"https://arstechnica.com/information-technology/2023/02/us-copyright-office-withdraws-copyright-for-ai-generated-comic-artwork/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2023/02/zarya_hero_2-760x380.jpg","publishedAt":"2023-02-23T18:19:22Z","content":"Enlarge/ The cover of \"Zarya of the Dawn,\" a comic book created using Midjourney AI image synthesis in 2022.\r\n56 with \r\nOn Tuesday, the US Copyright Office declared that images created using the AI-p… [+5362 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Brandon Widder","title":"The Beats Fit Pro earbuds in their new bright yellow color are already $30 off","description":"The new color of Beats Fit Pro earbuds are on sale for about $170. Apple’s last-gen iPad from 2021 returns to its best price of $269. You can also save on e-bikes, Sony’s SRS-XB33 Bluetooth speaker, and Yeedi’s Vac 2 Pro robot vacuum.","url":"https://www.theverge.com/2023/2/24/23612159/beats-fit-pro-apple-ipad-yeedi-vac-sony-srsxb33-bluetooth-speaker-ebikes-deal-sale","urlToImage":"https://cdn.vox-cdn.com/thumbor/LM0qykhANgwhopQM5k19Id8xsiQ=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/24457952/beats_fit_pro_yellow.jpg","publishedAt":"2023-02-24T15:18:29Z","content":"The Beats Fit Pro earbuds in their new bright yellow color are already $30 off\r\nThe Beats Fit Pro earbuds in their new bright yellow color are already $30 off\r\n / You can also save on Sonys picnic-fr… [+6757 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Joseph Long","title":"Will A.I. Steal all the Code and Take all the Jobs?","description":"New technology often brings with it a bit of controversy. When considering stem cell therapies, self-driving cars, genetically modified organisms, or nuclear power plants, fears and concerns come to mind …read more","url":"https://hackaday.com/2023/03/08/will-a-i-steal-all-the-code-and-take-all-the-jobs/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/03/AIcoding.jpg","publishedAt":"2023-03-08T15:00:33Z","content":"New technology often brings with it a bit of controversy. When considering stem cell therapies, self-driving cars, genetically modified organisms, or nuclear power plants, fears and concerns come to … [+9901 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"bmetzger@insider.com (Bryan Metzger)","title":"Democratic Rep. Abigail Spanberger is calling for a new House hearing on stock trade ban legislation: 'We must continue the momentum'","description":"With Republicans in control of the House, some lawmakers are looking to restart the clock on efforts to ban stock trading by members of Congress.","url":"https://www.businessinsider.com/abigail-spanberger-letter-new-hearing-stock-trade-ban-2023-2","urlToImage":"https://i.insider.com/63f8c3c188f76900192d2282?width=1200&format=jpeg","publishedAt":"2023-02-24T15:36:54Z","content":"Aiming to \"continue the momentum\" of last year's push to ban members of Congress from trading stocks, Democratic Rep. Abigail Spanberger of Virginia is asking the Committee on House Administration to… [+1934 chars]"},{"source":{"id":null,"name":"Android Central"},"author":"andrew.myrick@futurenet.com (Andrew Myrick)","title":"Google I/O 2023 puzzle is here to tease everyone ahead of Google's next event","description":"If you were wondering when Google I/O 2023 would take place, the wait is almost over. Google has shared its yearly puzzle, which will (eventually) tell us when I/O is happening.","url":"https://www.androidcentral.com/phones/google-io-2023-puzzle","urlToImage":"https://cdn.mos.cms.futurecdn.net/SSaDyhFZAf8WhBVrM9xyTW-1200-80.jpg","publishedAt":"2023-03-07T21:22:50Z","content":"<ul><li>Google has started teasing I/O 2023 with a new series of puzzles.</li><li>There are a total of six different main puzzles to complete, along with another that involves rearranging the main on… [+2225 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Al Williams","title":"Emulating All the TRS-80 Software","description":"Even if you didn’t own a TRS-80, the widespread footprint of Radio Shack in malls meant that if you are old enough, it is a good bet you have seen one and maybe even played with one. The game…","url":"https://hackaday.com/2023/02/27/emulating-all-the-trs-80-software/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/02/dancing_demon.png","publishedAt":"2023-02-27T18:00:59Z","content":"Even if you didn’t own a TRS-80, the widespread footprint of Radio Shack in malls meant that if you are old enough, it is a good bet you have seen one and maybe even played with one. The games were c… [+4947 chars]"},{"source":{"id":null,"name":"The Guardian"},"author":"Daniel Gallan","title":"England and Borthwick seek advice from referees over ‘reckless’ scrum","description":"<ul><li>Wayne Barnes and Joel Jutge consulted to rectify problem</li><li>England focus on ball retention before Wales clash</li></ul>England’s coaches have sought advice from some of the world’s leading referees, including Wayne Barnes and Joël Jutge, to rect…","url":"https://www.theguardian.com/sport/2023/feb/15/england-and-borthwick-seek-advice-from-referees-over-reckless-scrum","urlToImage":"https://i.guim.co.uk/img/media/4afb9baec55fcf223ba3b616f249ca3e609e1159/0_137_4136_2483/master/4136.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c83b5990db353e00949ffbdd09a9cedd","publishedAt":"2023-02-15T22:00:22Z","content":"Englands coaches have sought advice from some of the worlds leading referees, including Wayne Barnes and Joël Jutge, to rectify their reckless scrum.\r\nLast year the English pack retained the ball fro… [+2299 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Al Williams","title":"What Does an Electron Look Like?","description":"In school, you probably learned that an atom was like a little solar system with the nucleus as the sun and electrons as the planets. The problem is, as [The Action Lab] points out, the math tells …","url":"https://hackaday.com/2023/03/06/what-does-an-electron-look-like/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/03/electron.png","publishedAt":"2023-03-06T19:00:00Z","content":"In school, you probably learned that an atom was like a little solar system with the nucleus as the sun and electrons as the planets. The problem is, as [The Action Lab] points out, the math tells us… [+1030 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Maya Posch","title":"Curve Tracer Design for Power Vacuum Tubes Testing","description":"Regardless of the mythical qualities that are all too often attributed to vacuum tubes, they are still components that can be damaged and wear out over time. Much like with transistors and kin, the…","url":"https://hackaday.com/2023/02/15/curve-tracer-design-for-power-vacuum-tubes-testing/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/02/vacuum_tube_curve_tracer.jpg","publishedAt":"2023-02-15T09:00:57Z","content":"Regardless of the mythical qualities that are all too often attributed to vacuum tubes, they are still components that can be damaged and wear out over time. Much like with transistors and kin, they … [+1151 chars]"},{"source":{"id":null,"name":"Uxdesign.cc"},"author":"Tristan Wolff","title":"ControlNET and Stable Diffusion: A Game Changer for AI Image Generation","description":"ControlNet is revolutionary. With a new paper submitted last week, the boundaries of AI image and video creation have been pushed even further: It is now possible to use sketches, outlines, depth…","url":"https://bootcamp.uxdesign.cc/controlnet-and-stable-diffusion-a-game-changer-for-ai-image-generation-83555cb942fc","urlToImage":"https://miro.medium.com/max/1200/1*YF-pjO4eI-Wo-OX1ZsiuoQ.png","publishedAt":"2023-02-20T03:20:13Z","content":"ControlNET and Stable Diffusion: A Game Changer for AI Image Generation\r\nhttps://arxiv.org/abs/2302.05543\r\nControlNet is revolutionary. With a new paper submitted last week, the boundaries of AI imag… [+2160 chars]"},{"source":{"id":null,"name":"Github.com"},"author":"total-typescript","title":"A 'CSS reset' for TypeScript, improving types for common JavaScript API's","description":"A &#39;CSS reset&#39; for TypeScript, improving types for common JavaScript API&#39;s - GitHub - total-typescript/ts-reset: A &#39;CSS reset&#39; for TypeScript, improving types for common JavaScri...","url":"https://github.com/total-typescript/ts-reset","urlToImage":"https://opengraph.githubassets.com/ee85bc2c8068a195d5e0ea38cfce9d75e218beedb612e3ba50cab26e89b20744/total-typescript/ts-reset","publishedAt":"2023-03-03T04:56:05Z","content":"TypeScript's built-in typings are not perfect. ts-reset makes them better.\r\nWithout ts-reset:\r\n<ul><li>\r\n.json (in fetch) and JSON.parse both return any</li><li>\r\n.filter(Boolean) doesn't behave how … [+7448 chars]"},{"source":{"id":null,"name":"Cohere.ai"},"author":null,"title":"Summarize texts up to 50K characters","description":"Cohere provides access to advanced Large Language Models and NLP tools through one easy-to-use API. Get started for free.","url":"https://dashboard.cohere.ai/playground/summarize","urlToImage":"https://dashboard.cohere.ai/images/share-img.png","publishedAt":"2023-02-22T19:20:27Z","content":"Input\r\n0 characters · 0 min read\r\nOutput\r\nYour summary will be output as a medium paragraph by default. To control the length and format, change it in Parameters."},{"source":{"id":null,"name":"MacRumors"},"author":"Tim Hardwick","title":"How to Access ChatGPT From Your Mac's Menu Bar","description":"OpenAI's ChatGPT chatbot offers a new generation of conversational AI functionality that promises to fundamentally change the technological landscape and the way people work. Here's how to access it directly from your Mac's menu bar. \n\n\n\n\n\nChatGPT is a next-g…","url":"https://www.macrumors.com/how-to/access-chatgpt-mac-menu-bar/","urlToImage":"https://images.macrumors.com/t/dxv-fL4alp8zuwzDwJ6j6haQnqM=/3040x/article-new/2023/03/macgpt.jpg","publishedAt":"2023-03-03T19:20:58Z","content":"OpenAI's ChatGPT chatbot offers a new generation of conversational AI functionality that promises to fundamentally change the technological landscape and the way people work. Here's how to access it … [+2083 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Nick Valencia, Paradise Afshar","title":"'Cop City' protester's hands were raised when fatally shot by police, family says","description":"A \"Cop City\" protester's hands were raised when law enforcement officers who were attempting to clear the site of a planned police and fire training facility near Atlanta opened fire, an autopsy commissioned by the activist's family found, attorneys say.","url":"https://www.cnn.com/2023/03/11/us/cop-city-atlanta-protester-autopsy/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/230122001516-01-manuel-esteban-paez-teran-memorial-012123.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2023-03-11T15:07:09Z","content":"A Cop City protesters hands were raised when law enforcement officers who were attempting to clear the site of a planned police and fire training facility near Atlanta opened fire, an autopsy commiss… [+4062 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"salarshani@businessinsider.com (Sarah Al-Arshani)","title":"US Copyright Office rejects trademark of AI-generated book images: They are 'not the product of human authorship'","description":"Kris Kashtanova wrote \"Zarya of the Dawn,\" an 18-page graphic novel that utilized AI-generated images from Midjourney.","url":"https://www.businessinsider.com/us-copyright-office-rejects-trademark-of-ai-generated-images-book-2023-2","urlToImage":"https://i.insider.com/63fa1e9b84099d001960cb44?width=1200&format=jpeg","publishedAt":"2023-02-25T15:58:33Z","content":"The US Copyright Office said that images in a graphic novel created using an artificial-intelligence system would not get copyright protection, Reuters first reported. \r\nThe office said in a letter t… [+1971 chars]"},{"source":{"id":null,"name":"Insiderintelligence.com"},"author":"insider@insider.com (Jenna McNamee)","title":"Wells Fargo adds financial planning with a personal touch to its mobile app","description":"Life Sync lets customers adjust their financial goals on the mobile app to get more accurate advice quickly. But goals that always change can’t be reached.","url":"https://www.insiderintelligence.com/content/wells-fargo-financial-planning-personal-app","urlToImage":"https://www.insiderintelligence.com/content/storage/5ea94d6ea891b4ffe5173fd49b4f47be/276021?im=FitAndFill,width=1200,height=630","publishedAt":"2023-02-27T17:30:27Z","content":"The news:Wells Fargo will add a financial planning platform for wealth clients to its mobile app, per\r\n American Banker.\r\nWells Fargo will also roll out its AI-powered virtual assistant\r\n, Fargo, in … [+2440 chars]"},{"source":{"id":null,"name":"Insiderintelligence.com"},"author":"insider@insider.com (Meaghan Yuen)","title":"Wise addresses cross-border payments friction with two new US offerings","description":"The payments fintech introduced Wise Business cards, which let businesses make cross-border payments at the mid-market exchange rate.","url":"https://www.insiderintelligence.com/content/wise-addresses-cross-border-payments-friction-with-two-new-us-offerings","urlToImage":"https://www.insiderintelligence.com/content/storage/socialsharingdefault/default-image-share.png?im=FitAndFill,width=1200,height=630","publishedAt":"2023-03-02T15:13:55Z","content":"The news: Cross-border payments fintech Wise rolled out two offerings in the US and unveiled new branding, per a press release. \r\n<ul><li>It introduced Wise Business cards, which connect to Wise acco… [+2481 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"gdean@insider.com (Grace Dean)","title":"Nestlé, the world's biggest consumer food company, says it will keep hiking prices in 2023, and that its rivals will have to do the same","description":"\"Inflation has left its mark on gross margins and profit margins,\" Nestlé CEO Mark Schneider said. \"Clearly, some repairing still needs to be done.\"","url":"https://www.businessinsider.com/nestle-raises-prices-inflation-nescafe-nesquik-cheerios-costs-2023-2023-2","urlToImage":"https://i.insider.com/63ef68bbf24f34001864bfcc?width=1200&format=jpeg","publishedAt":"2023-02-17T12:11:53Z","content":"Nestlé, the world's largest consumer food company, which owns brands such as Nesquik and Nescafé in the US, says it will continue hiking its prices in 2023.\r\n\"Inflation has left its mark on gross mar… [+2111 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Irish Traveller culture could be promoted in schools","description":"Research presents how their history and culture could be introduced to Irish education.","url":"https://www.bbc.co.uk/news/world-europe-64803783","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/8C69/production/_128854953_gettyimages-120410685.jpg","publishedAt":"2023-03-05T06:37:07Z","content":"\"It's a monstrous thing, because we've always been here.\"\r\nThat is one Traveller's take on what he sees as the omission of his community's culture in the Irish school curriculum.\r\nBut that could soon… [+5854 chars]"},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Chuong Nguyen","title":"Dealmaster: Lenovo’s best laptop is 50% off in latest doorbuster deal","description":"We've got big discounts on Lenovo's business laptop.","url":"https://arstechnica.com/gadgets/2023/03/dealmaster-lenovos-thinkpad-x1-carbon-gen-10-is-now-50-off/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2022/08/IMG_0331-760x380.jpeg","publishedAt":"2023-03-08T17:22:39Z","content":"Enlarge/ Lenovo's ThinkPad X1 Carbon Gen 10.\r\n16 with \r\nArguably one of the best business laptops on the market, Lenovo's ThinkPad X1 Carbon Gen 10 is now discounted by 50 percent. The Gen 10 version… [+3393 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Arya Voronova","title":"High-Contrast Images For Hacker Family Harmonics","description":"There’s a new addition to the Adafruit family, and it’s not a microcontroller board as you’d expect – however, we will still find plenty to learn from. On the Adafruit …read more","url":"https://hackaday.com/2023/02/13/high-contrast-images-for-hacker-family-harmonics/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/01/hadimg_highcontrast_adafruit_feat.jpg","publishedAt":"2023-02-13T09:00:22Z","content":"There’s a new addition to the Adafruit family, and it’s not a microcontroller board as you’d expect – however, we will still find plenty to learn from. On the Adafruit blog, [Phillip Torrone] shares … [+1297 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Joseph Long","title":"Tiny Tapeout 3: Get Your Own Chip Design to a Fab","description":"Custom semiconductor chips are generally big projects made by big companies with big budgets. Thanks to Tiny Tapeout, students, hobbyists, or anyone else can quickly get their designs onto an …read more","url":"https://hackaday.com/2023/03/05/tiny-tapeout-3-get-your-own-chip-deign-to-a-fab/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/03/Tiny-Tapeout-3.png","publishedAt":"2023-03-05T09:00:00Z","content":"Custom semiconductor chips are generally big projects made by big companies with big budgets. Thanks to Tiny Tapeout, students, hobbyists, or anyone else can quickly get their designs onto an actual … [+1681 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Arya Voronova","title":"DIY STM32 Scope is Simple, Cheap, and Featureful","description":"Would you like to have a small digital oscilloscope? Do you have a spare BlackPill (STM32F401) board and a TFT display laying around? [tvvlad1234] presents us with a simple and educational digital …","url":"https://hackaday.com/2023/02/27/diy-stm32-scope-is-simple-cheap-and-featureful/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/02/hadimg_pillscope_feat.jpeg","publishedAt":"2023-02-27T19:30:21Z","content":"Would you like to have a small digital oscilloscope? Do you have a spare BlackPill (STM32F401) board and a TFT display laying around? [tvvlad1234] presents us with a simple and educational digital st… [+1390 chars]"},{"source":{"id":null,"name":"9to5Mac"},"author":"Michael Potuck","title":"Spotify says Apple’s DMA compliance must includes these changes","description":"As European Union officials work on the implementation of the Digital Markets Act (DMA) that formally went into effect last fall, a stakeholder workshop was held today by the European Commission to get input on “app store related provisions.” Spotify was one …","url":"https://9to5mac.com/2023/03/06/spotify-says-dma-apple-compliance-must-do-this/","urlToImage":"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/11/apple-eu-app-store.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1","publishedAt":"2023-03-06T18:17:10Z","content":"As European Union officials work on the implementation of the Digital Markets Act (DMA) that formally went into effect last fall, a stakeholder workshop was held today by the European Commission to g… [+2475 chars]"},{"source":{"id":null,"name":"Rock Paper Shotgun"},"author":"Will Judd","title":"This compact wireless keyboard is the perfect Steam Deck or media center PC companion","description":"Logitech make some great keyboards and mice, and now you can get their K400 Plus wireless keyboard/trackpad combo for £25. That's £20 less than its normal price, and a great value for one of the most convenient peripherals for Steam Deck, media PCs, Raspberry…","url":"https://www.rockpapershotgun.com/this-compact-wireless-keyboardtrackpad-is-the-perfect-steam-deck-media-center-pc-companion","urlToImage":"https://assets2.rockpapershotgun.com/logitech-k400-plus.jpg/BROK/thumbnail/1200x630/logitech-k400-plus.jpg","publishedAt":"2023-02-21T22:09:38Z","content":"Logitech make some great keyboards and mice, and now you can get their K400 Plus wireless keyboard/trackpad combo for £25. That's £20 less than its normal price, and a great value for one of the most… [+1672 chars]"},{"source":{"id":null,"name":"AppleInsider"},"author":"news@appleinsider.com (William Gallagher)","title":"Folding iPhone may be touch sensitive all over","description":"Apple has been granted a patent for touch sensitive control areas including solid-state buttons on any surface of the current iPhone design, and a folding one.The touch screen wasn't invented with the iPhone, but Apple did make it ubiquitous. Potentially as s…","url":"https://appleinsider.com/articles/23/02/14/folding-iphone-may-be-touch-sensitive-all-over","urlToImage":"https://photos5.appleinsider.com/gallery/53001-106089-000-lead-Touch-Sensitiive-xl.jpg","publishedAt":"2023-02-14T15:22:14Z","content":"AppleInsider may earn an affiliate commission on purchases made through links on our site.\r\nApple has been granted a patent for touch sensitive control areas including solid-state buttons on any surf… [+3985 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Al Williams","title":"The First Gui? Volscan Controls the Air","description":"In the 1950s,  computers were, for the most part, ponderous machines. But one machine offered a glimpse of the future. The Volscan was probably the first real air traffic computer designed to handl…","url":"https://hackaday.com/2023/03/09/the-first-gui-volscan-controls-the-air/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/03/Volscan.jpg","publishedAt":"2023-03-09T15:00:59Z","content":"In the 1950s,  computers were, for the most part, ponderous machines. But one machine offered a glimpse of the future. The Volscan was probably the first real air traffic computer designed to handle … [+6280 chars]"},{"source":{"id":null,"name":"Substack.com"},"author":"Matt Frisbie","title":"Let's build a Chrome extension that steals everything","description":"Today's adventure: DIY whole hog data exfiltration","url":"https://mattfrisbie.substack.com/p/spy-chrome-extension","urlToImage":"https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8f0e4276-498c-4d46-80fb-466437307695_2184x1426.png","publishedAt":"2023-02-21T23:27:52Z","content":"Manifest v3 may have taken some of the juice out of browser extensions, but I think there is still plenty left in the tank. To prove it, lets build a Chrome extension that steals as much data as poss… [+14801 chars]"},{"source":{"id":null,"name":"Github.io"},"author":null,"title":"Why Sat Is Hard","description":"An introductory post about complexity theory today!\nIt is relatively well-known that there exist so-called NP-complete problems --- particularly hard problems, such that, if you solve one of them efficiently, you can solve all of them efficiently.\nI think I'v…","url":"https://matklad.github.io/2023/02/21/why-SAT-is-hard.html","urlToImage":null,"publishedAt":"2023-02-24T04:44:55Z","content":"An introductory post about complexity theory today!\r\nIt is relatively well-known that there exist so-called NP-complete problems — particularly hard problems, such that, if you solve one of them effi… [+8069 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Al Williams","title":"Retro Gadgets: Make Your Scope Dual Channel","description":"We live in a time when having an oscilloscope is only a minor luxury. But for many decades, a good scope was a major expense, and almost no hobbyist had a brand new one unless it was of very poor q…","url":"https://hackaday.com/2023/02/21/retro-gadgets-make-your-scope-dual-channel/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/02/neat-electronic-device-from-1939-explained-with-restoration-zaozbmcxjao-webm-shot0008_featured.png","publishedAt":"2023-02-21T18:58:41Z","content":"We live in a time when having an oscilloscope is only a minor luxury. But for many decades, a good scope was a major expense, and almost no hobbyist had a brand new one unless it was of very poor qua… [+4219 chars]"},{"source":{"id":null,"name":"Zuru.tech"},"author":"Marco Venturelli","title":"The dangers behind image resizing","description":"The expectation that the behaviour for image resizing is the same among the libraries can cause unforeseen problems...","url":"https://zuru.tech/blog/the-dangers-behind-image-resizing","urlToImage":"https://storage.googleapis.com/strapi-test-bucket/The_dangers_behind_image_resizing_aea675eb68/The_dangers_behind_image_resizing_aea675eb68.png","publishedAt":"2023-02-16T10:11:46Z","content":"Image resizing is a very common geometrical transformation of an image, and it simply consists of a scaling operation.\r\nSince it is one of the most common image processing operations, you can find it… [+13983 chars]"},{"source":{"id":null,"name":"Android Central"},"author":"andrew.myrick@futurenet.com (Andrew Myrick)","title":"ChromeOS 110 arrives with improved Launcher search and 'Super Resolution Audio'","description":"Google has started rolling out ChromeOS 110, bringing with it improvements to the Launcher, accessibility tools, and much more.","url":"https://www.androidcentral.com/chromebooks-laptops/chromeos-110-release","urlToImage":"https://cdn.mos.cms.futurecdn.net/YZ6cmaHopBfeb5KMsgw4r7-1200-80.jpg","publishedAt":"2023-02-16T22:43:58Z","content":"<ul><li>ChromeOS 110 is now rolling out for Chromebook owners on the Stable channel. </li><li>This update includes numerous bug fixes, in addition to a few smaller changes. </li><li>Arguably the bigg… [+2975 chars]"},{"source":{"id":null,"name":"Processmechanics.com"},"author":"VanL","title":"AI-Assisted Art – A Mixed Decision from the Copyright Office","description":"We received the decision today relative to Kristina Kashtanova's case about the comic book Zarya of the Dawn. Kris will keep the copyright registration, but it will be limited to the text and the whole work as a compilation.\n\nIn one sense this is a success, i…","url":"https://www.processmechanics.com/2023/02/22/a-mixed-decision-from-the-us-copyright-office/","urlToImage":null,"publishedAt":"2023-02-22T22:39:51Z","content":"We received the decision today relative to Kristina Kashtanova's case about the comic book Zarya of the Dawn\r\n. Kris will keep the copyright registration, but it will be limited to the text and the w… [+9632 chars]"},{"source":{"id":null,"name":"MacRumors"},"author":"Tim Hardwick","title":"How to Set Up and Use the Built-in 2FA Code Generator in iOS","description":"With online account hacking becoming increasingly widespread, all users should make sure they're taking every security measure available to them. If you use Apple devices, consider using Apple verification codes to protect your accounts. Keep reading to learn…","url":"https://www.macrumors.com/how-to/set-up-and-use-2fa-ios/","urlToImage":"https://images.macrumors.com/t/CRod7L4sL9ESHOqblJznXzws8AM=/2844x/article-new/2020/07/iPhone-Security-Feature-1.jpg","publishedAt":"2023-02-23T00:49:04Z","content":"With online account hacking becoming increasingly widespread, all users should make sure they're taking every security measure available to them. If you use Apple devices, consider using Apple verifi… [+2896 chars]"},{"source":{"id":null,"name":"The Guardian"},"author":"Paul MacInnes","title":"Karen Carney says review of women’s football will ‘leave no stone unturned’","description":"<ul><li>Ian Wright and Hope Powell among experts included</li><li>Game could become closed American-style league</li></ul>Karen Carney says her government-commissioned review of women’s football will focus on building the game up from its foundations, as she …","url":"https://www.theguardian.com/football/2023/feb/14/karen-carney-says-review-of-womens-football-will-leave-no-stone-unturned","urlToImage":"https://i.guim.co.uk/img/media/d4eeeeb030f70028ecb8b038a5f8a406262179b8/0_8_3422_2053/master/3422.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1f842bef0133dd5cade3e32b335de0b2","publishedAt":"2023-02-14T22:30:12Z","content":"Karen Carney says her government-commissioned review of womens football will focus on building the game up from its foundations, as she announced Ian Wright, Hope Powell and the head of the NFL in Eu… [+3143 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Christina Maxouris","title":"Clashes over Atlanta's 'Cop City' led to a protester's killing and dozens of arrests. Here's how we got here -- and what comes next","description":"Nearly two dozen people are in jail after violent protests at a forest near Atlanta that's become a national focal point as authorities gear up to begin construction of a massive police and fire training facility.","url":"https://www.cnn.com/2023/03/08/us/cop-city-explainer/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/230306095625-06-atlanta-cop-city-protests-file-restricted-030523.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2023-03-08T11:57:18Z","content":"Nearly two dozen people are in jail after violent protests at a forest near Atlanta thats become a national focal point as authorities gear up to begin construction of a massive police and fire train… [+7302 chars]"},{"source":{"id":null,"name":"Buildt.ai"},"author":"Alistair Pullen","title":"Custom Embeddings: Why going viral caused us to rip out everything in a weekend","description":"Tom Blomfield gave us the sage advice of stopping the onboarding of customers who were going to have a bad experience, as getting them to come back would be very tricky.","url":"https://www.buildt.ai/blog/viral-ripout","urlToImage":"http://static1.squarespace.com/static/63dac39a0ea2353d0e132a36/63daf57772bc814cc05cac89/63f6a6b28ac9814c501fd71f/1677109240454/product_hunt_slide_1.png?format=1500w","publishedAt":"2023-02-22T23:45:30Z","content":"As you can see, the over lap has been drasitcally reduced, so the chances of you successfully matching an answer that is relevant are drastically higher.\r\nOur implementation of this was interesting, … [+2456 chars]"},{"source":{"id":null,"name":"9to5Mac"},"author":"Michael Potuck","title":"Apple Watch gets OpenAI’s popular chatbot with watchGPT app","description":"Whether you’re regularly using ChatGPT or want to check it out for the first time, OpenAI’s hit chatbot has made the jump to Apple Watch with a dedicated third-party app called watchGPT. Here are all the details…\n more…\nThe post Apple Watch gets OpenAI’s popu…","url":"https://9to5mac.com/2023/03/08/apple-watch-gets-chatgpt-watchgpt/","urlToImage":"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2023/03/apple-watch-gpt.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1","publishedAt":"2023-03-08T17:38:54Z","content":"Whether you’re regularly using ChatGPT or want to check it out for the first time, OpenAI’s hit chatbot has made the jump to Apple Watch with a dedicated third-party app called watchGPT. Here are all… [+1458 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Joseph Long","title":"Supercon 2022: Michael Whiteley Saves the Badge","description":"Michael Whiteley (aka [compukidmike]) is a badgelife celebrity. Together, he and his wife Katie make up MK Factor. They have created some of the most popular electronic conference badges. Of …read more","url":"https://hackaday.com/2023/03/03/supercon-2022-michael-whiteley-saves-the-badge/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/03/michael-whiteley-supercon-2022-lxoya07ie1i-mkv-shot0006_featured.png","publishedAt":"2023-03-03T18:02:47Z","content":"Michael Whiteley (aka [compukidmike]) is a badgelife celebrity. Together, he and his wife Katie make up MK Factor. They have created some of the most popular electronic conference badges. Of course, … [+4363 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Dave Rowntree","title":"A Low Budget DIY Vibrotactile Stimulator For Experimental CRS","description":"Modern techniques of Coordinated Reset Stimulation (which is usually administered with invasive deep brain stimulation) can have a miraculous effect on those suffering from Parkinson’s disease. However, the CRS technique …read more","url":"https://hackaday.com/2023/02/18/a-low-budget-diy-vibrotactile-stimulator-for-experimental-crs/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/02/device.jpg","publishedAt":"2023-02-19T00:00:42Z","content":"Modern techniques of Coordinated Reset Stimulation (which is usually administered with invasive deep brain stimulation) can have a miraculous effect on those suffering from Parkinson’s disease. Howev… [+2213 chars]"},{"source":{"id":null,"name":"Openai.com"},"author":"OpenAI","title":"How should AI systems behave, and who should decide?","description":"OpenAI’s mission is to ensure that artificial general intelligence (AGI) benefits all of humanity. We therefore think a lot about the behavior of AI systems we build in the run-up to AGI, and the way in which that behavior is determined.\n\n\n\nSince our launch o…","url":"https://openai.com/blog/how-should-ai-systems-behave/","urlToImage":"https://openai.com/content/images/2023/02/how-should-ai-systems-behave.png","publishedAt":"2023-02-16T18:01:39Z","content":"OpenAIs mission is to ensure that artificial general intelligence (AGI) benefits all of humanity. We therefore think a lot about the behavior of AI systems we build in the run-up to AGI, and the way … [+8856 chars]"},{"source":{"id":null,"name":"Github.com"},"author":"microsoft","title":"Prompt Engine – Microsoft's prompt engineering library","description":"A library for helping developers craft prompts for Large Language Models - GitHub - microsoft/prompt-engine: A library for helping developers craft prompts for Large Language Models","url":"https://github.com/microsoft/prompt-engine","urlToImage":"https://opengraph.githubassets.com/d0a8318d95f14e9eb9c824ae74caad63c5cac59e7a0e87262cad42bbb40ffd91/microsoft/prompt-engine","publishedAt":"2023-02-15T21:46:36Z","content":"This repo contains an NPM utility library for creating and maintaining prompts for Large Language Models (LLMs).\r\nBackground\r\nLLMs like GPT-3 and Codex have continued to push the bounds of what AI is… [+10733 chars]"},{"source":{"id":null,"name":"Slashdot.org"},"author":"BeauHD","title":"MIT Team Makes a Case For Direct Carbon Capture From Seawater, Not Air","description":"The oceans soak up enormous quantities of carbon dioxide, and MIT researchers say they've developed a way of releasing and capturing it that uses far less energy than direct air capture -- with some other environmental benefits to boot. New Atlas reports: Acc…","url":"https://news.slashdot.org/story/23/02/17/2333220/mit-team-makes-a-case-for-direct-carbon-capture-from-seawater-not-air","urlToImage":"https://a.fsdn.com/sd/topics/earth_64.png","publishedAt":"2023-02-18T02:02:00Z","content":"According to IEA figures from 2022, even the more efficient air capture technologies require about 6.6 gigajoules of energy, or 1.83 megawatt-hours per ton of carbon dioxide captured. Most of that en… [+2551 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"sjackson@insider.com (Sarah Jackson)","title":"Check out ChatGPT's guidelines for difficult conversations, including rules for discussing culture war topics and responding to users trying to trick the chatbot","description":"OpenAI's guidelines say ChatGPT should try to avoid questions that are difficult to answer, including \"direct questions about its own desires.\"","url":"https://www.businessinsider.com/see-chatgpt-rules-difficult-conversations-culture-wars-users-tricking-chatbot-2023-2","urlToImage":"https://i.insider.com/63dfeb520a08ae0018a6ccee?width=1200&format=jpeg","publishedAt":"2023-02-17T20:06:27Z","content":"OpenAI has shared a glimpse into the guidance ChatGPT is intended to follow in sensitive situations.\r\nIn a blog post Thursday, the company said it's working on improving the artificial intelligence c… [+2737 chars]"},{"source":{"id":null,"name":"Theregister.com"},"author":"Katyanna Quach","title":"Workers who help Teslas become robots explore starting a union to avoid same fate","description":"Elon Musk has already said he likes the idea of less human input into the data labelling process these folks drive\nA group of workers employed to label data at Tesla's Autopilot division in Buffalo, New York, launched a campaign to form an official union on T…","url":"https://www.theregister.com/2023/02/15/tesla_autopilot_workers_are_launching/","urlToImage":"https://regmedia.co.uk/2017/06/27/tesla_model_s.jpg","publishedAt":"2023-02-15T04:14:05Z","content":"A group of workers employed to label data at Tesla's Autopilot division in Buffalo, New York, launched a campaign to form an official union on Tuesday.\r\nUnder US law, unions can bargain with employer… [+2900 chars]"},{"source":{"id":null,"name":"Sustainful.tech"},"author":"sustainful","title":"Go is 17 times more sustainable than Python","description":"Sustainability in Artificial Intelligence – Comparing Python and Golang side by side.","url":"https://sustainful.tech/blog/golang-is-17-times-more-sustainable-than-python-in-depth-side-by-side-comparison/","urlToImage":"https://sustainful.tech/wp-content/uploads/2023/01/go-vs-python-transparent-2x1-0.png","publishedAt":"2023-02-18T16:48:32Z","content":"In this minimal Neural Network, we define a single neuron with 3 inputs and 1 outputs. The training operation is extremely simple as well.\r\nFor each training set, we have 3 inputs and the expected re… [+694 chars]"},{"source":{"id":null,"name":"CNET"},"author":"Lori Grunin","title":"Best Monitors We've Tested in 2023 - CNET","description":"Dell, HP, Apple and more hit our list of top monitors we've tested recently.","url":"https://www.cnet.com/tech/computing/best-monitors-weve-tested-in-2023/","urlToImage":"https://www.cnet.com/a/img/resize/1a7f684baa55a4d7e69c7be7c08af6e09209f593/hub/2022/03/09/a1191aee-402d-427e-a7da-48fadf71e54a/alienware-34-curved-qd-oled-aw3423dw-blue.jpg?auto=webp&fit=crop&height=630&width=1200","publishedAt":"2023-03-01T19:22:00Z","content":"Though money's still tight for a lot of folks, the days of desperately hunting for a $200 monitor for every member of a suddenly working-and-schooling-at-home family are long gone. The good news is t… [+10898 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Arya Voronova","title":"Laptop Motherboard? No, x86 Single-Board Computer!","description":"Sometimes a Raspberry Pi will not cut it – especially nowadays, when the prices are high and the in-stock amounts are low. But if you look in your closet, you might find a decently-specced la…","url":"https://hackaday.com/2023/02/27/laptop-motherboard-no-x86-single-board-computer/","urlToImage":"https://hackaday.com/wp-content/uploads/2023/02/Motherboard.jpg","publishedAt":"2023-02-27T15:00:20Z","content":"Sometimes a Raspberry Pi will not cut it – especially nowadays, when the prices are high and the in-stock amounts are low. But if you look in your closet, you might find a decently-specced laptop wit… [+8288 chars]"},{"source":{"id":null,"name":"Rogueamoeba.com"},"author":"John Gruber","title":"The Rogue Amoeba Historic Screenshot Archive","description":"Take a trip to the past.","url":"https://weblog.rogueamoeba.com/2023/03/03/come-visit-the-rogue-amoeba-historic-screenshot-archive/","urlToImage":"https://weblog.rogueamoeba.com/wp-content/uploads/2023-03-03-screenshot-gallery/blog-banner@2x.png","publishedAt":"2023-03-06T21:33:24Z","content":"Paul Kafasis, writing at the Rogue Amoeba blog, celebrating the company’s 20th anniversary:\n\n\n For many years, noted Mac collector Stephen Hackett has\ndone wonderful work with the MacOS Screenshot Li… [+2385 chars]"},{"source":{"id":null,"name":"Avc.com"},"author":"Fred Wilson","title":"What Does “Native” Mean","description":"When a new technology comes to market, we often look for “native” applications of that technology. What is a “native” AI application? What is a “native” Web3 application? I have not seen a better articulation of “native” than my partner Albert’s post from 200…","url":"https://avc.com/2023/02/what-does-native-mean/","urlToImage":null,"publishedAt":"2023-02-21T11:08:16Z","content":"When a new technology comes to market, we often look for “native” applications of that technology.\r\nWhat is a “native” AI application?\r\nWhat is a “native” Web3 application?\r\nI have not seen a better … [+771 chars]"},{"source":{"id":null,"name":"9to5Mac"},"author":"Chance Miller","title":"Report: Apple’s Reality Pro headset won’t require an iPhone, but some features are ‘finicky in testing’","description":"Apple is hard at work refining the first version of its AR/VR headset ahead of an expected June announcement. A new report from Bloomberg today has a few details on the Reality Pro headset’s features and limitations, including whether or not it’ll require an …","url":"https://9to5mac.com/2023/02/26/apple-headset-reality-pro-iphone-features/","urlToImage":"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2023/01/apple-march-event-headset.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1","publishedAt":"2023-02-26T15:13:02Z","content":"Apple is hard at work refining the first version of its AR/VR headset ahead of an expected June announcement. A new report from Bloomberg today has a few details on the Reality Pro headsets features … [+2284 chars]"},{"source":{"id":null,"name":"Android Police"},"author":"Chandraveer Mathur","title":"Google Chrome is working on a faster way to close tabs","description":"A shortcut is in the works for rapid mouse navigation","url":"https://www.androidpolice.com/google-chrome-double-click-close-tabs/","urlToImage":"https://static1.anpoimages.com/wordpress/wp-content/uploads/2022/08/google-chrome-rainbow-in-the-sky.jpg","publishedAt":"2023-02-20T21:23:33Z","content":"Anyone who's found themselves working on a computer for any appreciable amount of time has no doubt picked up a bunch of handy keyboard shortcuts, shaving time off repetitive tasks and helping optimi… [+1986 chars]"},{"source":{"id":null,"name":"MakeUseOf"},"author":"Denis Kuria","title":"7 Tricks for Writing Better Python Code","description":"Clean up your Python code with these handy, simple tips.","url":"https://www.makeuseof.com/python-tricks-writing-better-code/","urlToImage":"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/02/hand-holding-python-logo.jpg","publishedAt":"2023-02-18T15:00:16Z","content":"Writing working code is not always enough; you should try to write well-structured code that’s easy to understand too. Clean code will make it easy for you—and others—to maintain your software.\r\nPyth… [+5939 chars]"},{"source":{"id":null,"name":"Schneier.com"},"author":"Bruce Schneier","title":"Putting Undetectable Backdoors in Machine Learning Models","description":"This is really interesting research from a few months ago:\nAbstract: Given the computational cost and technical expertise required to train machine learning models, users may delegate the task of learning to a service provider. Delegation of learning has clea…","url":"https://www.schneier.com/blog/archives/2023/02/putting-undetectable-backdoors-in-machine-learning-models.html","urlToImage":null,"publishedAt":"2023-02-23T19:37:45Z","content":"This is really interesting research from a few months ago:\nAbstract: Given the computational cost and technical expertise required to train machine learning models, users may delegate the task of lea… [+2604 chars]"},{"source":{"id":null,"name":"VentureBeat"},"author":"Matthew Sykes, Ubiquitous Energy","title":"Responding to the climate crisis requires untapped innovation","description":"Climate tech companies need R&D outcomes now. How innovators and entrepreneurs can turn to AI and ML to hasten and improve results.","url":"https://venturebeat.com/ai/responding-to-the-climate-crisis-requires-untapped-innovation/","urlToImage":"https://venturebeat.com/wp-content/uploads/2016/10/global.jpg?w=1200&strip=all","publishedAt":"2023-03-10T21:07:00Z","content":"The climate crisis is painfully evident all around the world. From historic droughts and fires to hurricanes and warming waters, its clear that climate change isnt just a future danger. Its a present… [+7461 chars]"},{"source":{"id":null,"name":"Adafruit.com"},"author":"Anne Barela","title":"Fast analogue input with Raspberry Pi Pico – HackSpace Magazine Issue 64 #RaspberryPiPico #Pico #CircuitPython @HackSpaceMag","description":"HackSpace Magazine Issue 64 – Soldering Irons on Test discusses how to get fast analog reads from a Raspberry Pi Pico in CircuitPython.CircuitPython is great for getting started with microcontroller programming, but it can have a few shortfalls. One of which …","url":"https://blog.adafruit.com/2023/02/21/fast-analogue-input-with-raspberry-pi-pico-hackspace-magazine-issue-64-raspberrypipico-pico-circuitpython-hackspacemag/","urlToImage":"https://cdn-blog.adafruit.com/uploads/2023/02/Untitled-22.png","publishedAt":"2023-02-21T16:47:46Z","content":"HackSpace Magazine Issue 64 – Soldering Irons on Test discusses how to get fast analog reads from a Raspberry Pi Pico in CircuitPython.\r\nCircuitPython is great for getting started with microcontrolle… [+3735 chars]"},{"source":{"id":null,"name":"AppleInsider"},"author":"news@appleinsider.com (Chip Loder)","title":"How to build your own RAID for macOS on a budget","description":"Today, RAID is fast and can speed up drive access on your Mac. Here's how to get started building your own, inexpensively.A Redundant Array of Inexpensive Disks (RAID) is a way to speed up your computer by using special hardware to make multiple drives look l…","url":"https://appleinsider.com/inside/macos/tips/how-to-build-your-own-raid-for-macos-on-a-budget","urlToImage":"https://photos5.appleinsider.com/gallery/53199-106856-lede-xl.jpg","publishedAt":"2023-03-09T13:53:24Z","content":"AppleInsider may earn an affiliate commission on purchases made through links on our site.\r\nToday, RAID is fast and can speed up drive access on your Mac. Here's how to get started building your own,… [+7854 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Kurt Knutsson, CyberGuy Report","title":"What's really killing your laptop battery?","description":"Worried about your laptop's battery life? Kurt \"The CyberGuy\" Knutsson provides advice on how you should be charging your devices to maximize their effectiveness.","url":"https://www.foxnews.com/tech/whats-really-killing-your-laptop-battery","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2023/02/1-LAPTOP-CHARGER.jpg","publishedAt":"2023-02-24T15:13:56Z","content":"Our laptops are super-expensive, so we want to ensure that we get as much use out of them as possible.  \r\nThere is a common misconception out there about how to correctly charge your laptop to make t… [+5861 chars]"},{"source":{"id":null,"name":"Github.com"},"author":"s-a","title":"Free Music/Audio Visualizer Software to Render Videos","description":"Music Visualizer Software on steroids. Contribute to s-a/sonic-sound-picture development by creating an account on GitHub.","url":"https://github.com/s-a/sonic-sound-picture","urlToImage":"https://opengraph.githubassets.com/27787f65dae1b0c03324088a9c67ad0e09e89f895d81af90051ca7de9a79f5d9/s-a/sonic-sound-picture","publishedAt":"2023-02-28T17:27:13Z","content":"Sonic Sound Picture (SSP) Cross platform Music Visualizer Software based on Blender\r\nLinks\r\nWorkflow\r\n1. Select Audio\r\n2. Select a template\r\n3. Template configuration\r\n4. Deliver video file\r\nCreate n… [+5893 chars]"},{"source":{"id":null,"name":"Stackexchange.com"},"author":null,"title":"Why does the all 0 public key have a known private key in SR25519 and ED25519?","description":"We have seen evidence that users can sign messages using the SR25519 and ED25519 public key with all zeros.\nWhy or how is the private key to this public key known?\nAre there any other things users ...","url":"https://substrate.stackexchange.com/questions/982/why-does-the-all-0-public-key-have-a-known-private-key-in-sr25519-and-ed25519","urlToImage":"https://cdn.sstatic.net/Sites/substrate/Img/apple-touch-icon@2.png?v=672eeb35bd47","publishedAt":"2023-03-05T16:58:22Z","content":"Yes, it's a consequence of the Edwards curve models used, but secp256k1 is a short Weierstrass curve.\r\nEd25519 has the identity (0,1) in Affine coordinates, meaning (0,1) + (0,1) = (0,1) in Ed25519. … [+1082 chars]"},{"source":{"id":null,"name":"MakeUseOf"},"author":"Jack Slater","title":"How to Add Links to Excel Spreadsheets","description":"Want to learn how to add links to your Excel spreadsheets? Here's how to make your data more interactive and accessible.","url":"https://www.makeuseof.com/add-links-to-excel-spreadsheets/","urlToImage":"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/02/excel-logo.jpg","publishedAt":"2023-03-02T17:45:16Z","content":"Links aren’t just something for interlinking websites. Many users also need to incorporate links within document files like Excel spreadsheets. Adding hyperlinks to Excel spreadsheets enables users t… [+7333 chars]"},{"source":{"id":null,"name":"Joshwcomeau.com"},"author":null,"title":"Common Beginner Mistakes with React","description":"I used to teach React at a local coding bootcamp, and I noticed that students kept getting tripped up by the same handful of things. In this article, we're going to go through 9 of the most dastardly gotchas. I'll show you how to solve these common problems, …","url":"https://www.joshwcomeau.com/react/common-beginner-mistakes/","urlToImage":"https://www.joshwcomeau.com/images/og-common-beginner-mistakes.jpg","publishedAt":"2023-03-11T14:48:55Z","content":"Introduction\r\nA couple years ago, I was teaching React at a local coding bootcamp, and I noticed that there were a handful of things that kept catching students off guard. People kept falling into th… [+14166 chars]"},{"source":{"id":null,"name":"MakeUseOf"},"author":"Sai Ashish Konchada","title":"Build a Random Image Fetcher Using Python","description":"The Unsplash API is easy to use, especially together with Python's Requests module. Start fetching sample images using these tools today.","url":"https://www.makeuseof.com/python-random-image-fetcher/","urlToImage":"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/02/polaroid-camera-and-pictures-on-a-wooden-surface.jpg","publishedAt":"2023-02-22T20:00:15Z","content":"If you’re developing or designing a website, you probably need to get hold of some stock images. They can be helpful for prototyping, or even to use in your production app.\r\nYou can easily build a ra… [+4478 chars]"},{"source":{"id":null,"name":"AppleInsider"},"author":"news@appleinsider.com (William Gallagher)","title":"Meta leaks its AR four-year plan before Apple can beat them","description":"Meta has made sure its new AR/VR plans would leak, as it tries to leverage its five-year lead to establish itself as the headset company to beat — before Apple makes its announcements.Meta's Quest Pro headset launched to poor reviewsFacebook owner Meta has ha…","url":"https://appleinsider.com/articles/23/03/01/meta-leaks-its-ar-four-year-plan-before-apple-can-beat-them","urlToImage":"https://photos5.appleinsider.com/gallery/50783-100251-meta-quest-pro-xl.jpg","publishedAt":"2023-03-01T16:16:56Z","content":"Meta's Quest Pro headset launched to poor reviews\r\nAppleInsider may earn an affiliate commission on purchases made through links on our site.\r\nMeta has made sure its new AR/VR plans would leak, as it… [+6436 chars]"},{"source":{"id":null,"name":"The Guardian"},"author":"Simon Roberts","title":"WRU says ‘no room for manoeuvre’ on contracts despite players’ strike threat","description":"<ul><li>PRB says clubs ‘paying salaries their businesses cannot afford’</li><li>Bradley Davies urges WRU to listen to players’ concerns</li></ul>The WRU has insisted there is “no room for manoeuvre” on the budget for player contracts in Wales despite the thre…","url":"https://www.theguardian.com/sport/2023/feb/15/wru-says-no-room-for-manoeuvre-on-contracts-despite-players-strike-threat","urlToImage":"https://i.guim.co.uk/img/media/5958914f73b7643f837c2b1fe2335a17a4000d70/0_400_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ffa87977379c29f3399a380dc31d5585","publishedAt":"2023-02-15T18:25:35Z","content":"The Welsh Rugby Union and the Welsh regions have said there is no room for manoeuvre on the budget for player contracts in Wales despite the threat of strike action putting the countrys Six Nations f… [+4634 chars]"},{"source":{"id":null,"name":"The Guardian"},"author":"Stuart Jeffries","title":"Dinosaur with Stephen Fry review – as enchanting as Jurassic Park","description":"This four-part series uses CGI beasts to make it look like its host has been sent back in time, and it’s excellent – full of fascinating insights and gripping experimentsThe average elephant has to eat 150kg of food a day. I’m no scientist but that’s probably…","url":"https://www.theguardian.com/tv-and-radio/2023/feb/12/dinosaur-with-stephen-fry-review-as-enchanting-as-jurassic-park","urlToImage":"https://i.guim.co.uk/img/media/19ad60ea797f4c2f14e7316edee83884b8801369/0_0_3167_1900/master/3167.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&enable=upscale&s=c83ab5431b6441cbd9c7dde6852101c6","publishedAt":"2023-02-12T20:00:31Z","content":"The average elephant has to eat 150kg of food a day. Im no scientist but thats probably one reason elephants have never learned to speak, crochet or read the Booker longlist theyre too busy masticati… [+4772 chars]"},{"source":{"id":null,"name":"The Guardian"},"author":"Jennifer Rankin in Brussels","title":"EU sets target of 40% of clean tech to be made within the bloc by 2030","description":"Draft regulation is response to US subsidies and Chinese state support for green-tech sectorThe EU executive is eyeing a target that would see 40% of the bloc’s clean tech made in Europe by the end the decade, as part of a response to a wave of subsidies from…","url":"https://www.theguardian.com/world/2023/mar/07/eu-sets-target-of-40-of-clean-tech-to-be-made-within-the-bloc-by-2030","urlToImage":"https://i.guim.co.uk/img/media/a6eaa392140ffccd4e33d710cfad1e07b9e0988c/0_221_5500_3302/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=860a51c39f89682ea0646178aa68b2da","publishedAt":"2023-03-07T18:13:32Z","content":"The EU executive is eyeing a target that would see 40% of the blocs clean tech made in Europe by the end the decade, as part of a response to a wave of subsidies from the US and China.\r\nAccording to … [+4063 chars]"},{"source":{"id":null,"name":"The Guardian"},"author":"John Naughton","title":"Misplaced fears of an ‘evil’ ChatGPT obscure the real harm being done | John Naughton","description":"Our tendency to humanise large language models and AI is daft – let’s worry about corporate grabs and environmental damageOn 14 February, Kevin Roose, the New York Times tech columnist, had a two-hour conversation with Bing, Microsoft’s ChatGPT-enhanced searc…","url":"https://www.theguardian.com/commentisfree/2023/mar/04/misplaced-fears-of-an-evil-chatgpt-obscure-the-real-harm-being-done","urlToImage":"https://i.guim.co.uk/img/media/5196334e0b85f6d026189f24a7e4f9c45b2ef623/99_32_3483_2090/master/3483.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tb3BpbmlvbnMucG5n&enable=upscale&s=59e1cd3b12c4979976414a6b441e872c","publishedAt":"2023-03-04T16:00:28Z","content":"On 14 February, Kevin Roose, the New York Times tech columnist, had a two-hour conversation with Bing, Microsofts ChatGPT-enhanced search engine. He emerged from the experience an apparently changed … [+4919 chars]"},{"source":{"id":null,"name":"The Guardian"},"author":"Minnie Degawan","title":"Indigenous people are Earth’s greatest champions. Listen to us – and watch biodiversity thrive | Minnie Degawan","description":"When discussions take place about environmental protection, we are always ignored. That’s a huge mistakeThis week the UK government is holding a meeting to discuss generating more finance to conserve and restore nature. This is following its adoption of a glo…","url":"https://www.theguardian.com/commentisfree/2023/feb/17/indigenous-people-earth-biodiversity-environmental-protection","urlToImage":"https://i.guim.co.uk/img/media/3aae1270731bf066c84f4269f0f030f8b97aeeb6/0_403_6000_3601/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=084f3921961e6ea586598ef3797f28b4","publishedAt":"2023-02-17T10:30:07Z","content":"This week the UK government is holding a meeting to discuss generating more finance to conserve and restore nature. This is following its adoption of a global biodiversity framework in Montreal the s… [+4605 chars]"},{"source":{"id":null,"name":"Cheezburger.com"},"author":"Eleonora Bader, Eleonora Bader","title":"21 Coworker Memes for Understaffed Teams of Employees With One Foot Out the Door","description":"It seems like there are barely any workplaces with adequately staffed teams of employees at this point. Everyone is wondering, 'Huh, why don't we have more workers?' when the answer is simple: People don't get paid enough to deal with rowdy, delinquent custom…","url":"https://cheezburger.com/19438085/21-coworker-memes-for-understaffed-teams-of-employees-with-one-foot-out-the-door","urlToImage":"https://i.chzbgr.com/thumb1200/19438085/h23F29F23/21-coworker-memes-for-understaffed-teams-of-employees-with-one-foot-out-the-door","publishedAt":"2023-02-23T00:00:00Z","content":"It seems like there are barely any workplaces with adequately staffed teams of employees at this point. Everyone is wondering, 'Huh, why don't we have more workers?' when the answer is simple: People… [+720 chars]"},{"source":{"id":null,"name":"The Guardian"},"author":"Lisa O'Carroll Brexit correspondent","title":"DUP warns Sunak not to leave Northern Ireland ‘abandoned to EU’","description":"Party pledges not to return to power-sharing if new Brexit trading deal does not meet seven conditions it laid downThe DUP has warned Rishi Sunak that the party will not return to power sharing if he leaves Northern Ireland “abandoned to the EU” under any new…","url":"https://www.theguardian.com/politics/2023/feb/17/dup-warns-sunak-brexit-trading-deal-northern-ireland-abandoned-to-eu","urlToImage":"https://i.guim.co.uk/img/media/36f131e3ea82ea5028493428d360c3867e24250f/0_232_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=374bc958b98393c79da6585d9bbe5df1","publishedAt":"2023-02-17T08:30:33Z","content":"The DUP has warned Rishi Sunak that the party will not return to power-sharing if he leaves Northern Ireland abandoned to the EU under any new deal he has cut with Brussels over the Brexit trading ar… [+3804 chars]"},{"source":{"id":null,"name":"The Guardian"},"author":"Jasper Jolly","title":"‘It’s a long-term journey we’re on’: taking a ride towards self-driving cars","description":"Nissan’s ServCity project shows how far autonomous vehicles have come and difficulties they still faceThe journey in a self-driving Nissan across Woolwich in south-east London begins smoothly enough: fitted with cameras and sensors, the electric car confident…","url":"https://www.theguardian.com/technology/2023/feb/17/taking-ride-self-driving-car-nissan-servcity-autonomous-vehicles","urlToImage":"https://i.guim.co.uk/img/media/2f66e683f5edcb67e86a0d9143ac0bd2e22252f3/122_0_1798_1080/master/1798.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=34068fc5a26a8f40fc61929ea44179d7","publishedAt":"2023-02-17T00:01:12Z","content":"The journey in a self-driving Nissan across Woolwich in south-east London begins smoothly enough: fitted with cameras and sensors, the electric car confidently handles pedestrian crossings, vans cutt… [+4943 chars]"}]}